//==================================================================================
//============================   BN_2048_mnemonics.js   ============================
//==================================================================================
// ---- Description ----
// Here is a Bip39 compatible (2048 words) wordlist for Bengali language. 
// Sources: 
//    - https://github.com/frekwencja/most-common-words-multilingual/blob/main/data/wordfrequency.info/bn.txt
//    - https://github.com/oprogramador/most-common-words-by-language
// License: BSD-3-Clause 
"use strict";

const BENGALI_MNEMONICS = [
"অংক", "অংশ", "অংশগ্রহণকারী", "অংশীদার", "অকপটে", "অকৃত্রিম", "অক্টোবর", "অক্ষমতা", "অক্সিজেন", "অখণ্ডতা", "অগত্যা", 
"অগ্রগতি", "অঙ্কুর", "অঙ্গীকার", "অজানা", "অজুহাত", "অজ্ঞাত", "অঞ্চল", "অণু", "অতিক্রম", "অতিথি", "অতিরিক্ত", "অতীত", 
"অত্যন্ত", "অদৃশ্য", "অদ্ভুত", "অধিকার", "অধিগ্রহণ", "অধিনায়ক", "অধিভুক্তি", "অধীন", "অধ্যয়ন", "অনন্য", "অনলাইন", 
"অনিবার্য", "অনিশ্চয়তা", "অনুগ্রহ", "অনুচ্ছেদ", "অনুপস্থিতি", "অনুবাদ", "অনুভূতি", "অনুমতি", "অনুরূপ", "অনুলিপি", "অনুশোচনা",
 "অনুষদ", "অনুসন্ধান", "অনেক", "অন্তত", "অন্ধকার", "অন্বেষণ", "অন্যান্য", "অপছন্দ", "অপট", "অপব্যবহার", "অপমান", 
 "অপরাধ", "অপরিহার্য", "অপসারণ", "অপারেশন", "অপেক্ষা", "অপেরা", "অপ্রত্যাশিত", "অফার", "অফিসার", "অবকাঠামো", 
 "অবতরণ", "অবদান", "অবমূল্যায়ন", "অবলম্বন", "অবশিষ্ট", "অবশেষে", "অবশ্যই", "অবসর", "অবস্থা", "অবিকল", "অবিলম্বে",
 "অবিশ্বাস্য", "অবৈধ", "অব্যাহত", "অভাব", "অভিজ্ঞতা", "অভিনেতা", "অভিপ্রায়", "অভিব্যক্তি", "অভিভাবক", "অভিমুখ", 
 "অভিযোগ", "অভিশাপ", "অভ্যন্তরীণ", "অর্জন", "অর্থনৈতিক", "অর্ধেক", "অলঙ্কারশাস্ত্র", "অলাভজনক", "অলিম্পিক", "অশ্বারোহণ",
 "অসম্ভব", "অসাধারণ", "অসামান্য", "অসুবিধা", "অসুস্থ", "অস্ত্র", "অস্থায়ী", "অস্বীকার", "অ্যাকাউন্ট", "আঁকা", "আংশিকভাবে", 
 "আইকন", "আইটেম", "আইন", "আইনজীবী", "আইনসভা", "আইনি", "আইফোন", "আইরিশ", "আউট", "আউটপুট", "আউটলেট", 
 "আউন্স", "আকর্ষণ", "আকার", "আকাশ", "আকৃতি", "আক্রমণ", "আখড়া", "আগমন", "আগস্ট", "আগামীকাল", "আগুন", 
 "আগে", "আগ্রহী", "আঘাত", "আঙুল", "আচরণ", "আচার", "আছে", "আঞ্চলিক", "আতঙ্ক", "আত্মা", "আদর্শ", "আদালত", 
 "আদিবাসী", "আদেশ", "আধুনিক", "আধ্যাত্মিক", "আনন্দিত", "আনা", "আনুকূল্য", "আনুগত্য", "আনুমানিক", "আনুষ্ঠানিক", 
 "আন্তর্জাতিক", "আন্দোলন", "আপত্তি", "আপনি", "আপস", "আপাতদৃষ্টিতে", "আপিল", "আপেক্ষিক", "আপেল", "আফ্রিকান", 
 "আবরণ", "আবর্জনা", "আবহাওয়া", "আবার", "আবাসিক", "আবির্ভূত", "আবিষ্কার", "আবেগপূর্ণ", "আবেদন", "আমন্ত্রণ", "আমরা", 
 "আমাকে", "আমাদের", "আমার", "আয়", "আয়তন", "আয়না", "আরব", "আরামপ্রদ", "আরো", "আরোগ্য", "আরোহণ", "আর্থিক",
 "আলগা", "আলফা", "আলমারি", "আলাপ", "আলিঙ্গন", "আলু", "আলোচ্যসূচি", "আলো", "আলোকচিত্র", "আলোচনা", "আলোড়ন",
 "আশা", "আশীর্বাদ", "আশ্চর্য", "আশ্রয়", "আসছে", "আসন", "আসন্ন", "আসবাবপত্র", "আসল", "আসলে", "আসা", "আহরণ", 
 "ই-মেইল", "ইঁদুর", "ইংরেজি", "ইউটিলিটি", "ইউনিট", "ইউরোপীয়", "ইক্যুইটি", "ইঙ্গিত", "ইচ্ছাশক্তি", "ইঞ্চি", "ইঞ্জিন", "ইতালিয়ান",
 "ইতিবাচক", "ইতিমধ্যে", "ইতিহাস", "ইত্যাদি", "ইনপুট", "ইনস্টিটিউট", "ইন্টারনেট", "ইন্দ্রিয়", "ইমিউন", "ইমেইল", "ইমেজ", 
 "ইরাকি", "ইরানীয়", "ইসরায়েল", "ইসলামিক", "ইস্পাত", "ইহুদি", "ঈগল", "উইং", "উকিল", "উচিত", "উচ্চ", "উজ্জ্বল", "উঠা", 
 "উত্তম", "উত্পাদন", "উদযাপন", "উদার", "উদাহরণ", "উদ্ঘাটন", "উদ্দেশ্য", "উদ্ধৃতি", "উদ্বেগ", "উদ্ভিদ", "উদ্যোগ", "উন্নয়ন", 
 "উপকূল", "উপগ্রহ", "উপজাতি", "উপত্যকা", "উপদেশ", "উপনিবেশ", "উপন্যাস", "উপভোগ", "উপর", "উপরে", "উপলক্ষ", 
 "উপলব্ধ", "উপশম", "উপসংহার", "উপসর্গ", "উপসাগর", "উপস্থিতি", "উপহার", "উপাদান", "উপায়", "উপার্জন", "উপেক্ষা", 
 "উভয়", "উল্টানো", "উল্লেখযোগ্য", "উষ্ণ", "উহু", "উৎপন্ন", "উৎপাদন", "উৎস", "উৎসব", "ঊর্ধ্বতন", "ঋণী", "এইগুলো", 
 "এইডস", "এইভাবে", "একই", "একইভাবে", "একক", "এককভাবে", "একচেটিয়া", "একটানা", "একত্রিত", "একদা", "একপাশে", 
 "একমত", "একর", "একসাথে", "একা", "একাকী", "একাগ্রতা", "একাডেমিক", "একাধিক", "একেবারে", "এক্সটেনশন", "এখতিয়ার", 
 "এখন", "এখনও", "এখনো", "এখানে", "এগিয়ে", "এছাড়াও", "এজলাস", "এটা", "এড়াতে", "এদিকে", "এনটাইটেল", "এন্টারপ্রাইজ",
 "এপ্রিল", "এবং", "এবং/অথবা", "এয়ারলাইন", "এলাকা", "এলার্ম", "এলোমেলো", "এশিয়ান", "এস্টেট", "ঐক্যবদ্ধ", "ঐতিহ্যগত", 
 "ঐশ্বরিক", "ওজন", "ওভার", "ওয়েব", "ওষুধ", "ওহে", "ঔপনিবেশিক", "ঔষধ", "ঔষধি", "কংক্রিট", "কংগ্রেস", "কক্ষপথ", 
 "কখন", "কখনই", "কখনও", "কঠিন", "কঠোর", "কণা", "কথিত", "কথোপকথন", "কদর্য", "কনসার্ট", "কনুই", "কন্যা", "কপাল", 
 "কপিরাইট", "কফি", "কবর", "কবি", "কবিতা", "কব্জি", "কভারেজ", "কমলা", "কমান্ডার", "কমিউনিস্ট", "কমিটি", "কমিশন", 
 "কমেডি", "কম্পিউটার", "কম্বল", "কয়লা", "করতে", "করদাতা", "করা", "করিডোর", "করুণা", "কর্তৃত্ব", "কর্নেল", "কর্পোরেট", 
 "কর্ম", "কলঙ্ক", "কলম", "কলস", "কলাম", "কলার", "কলেজ", "কল্পকাহিনী", "কল্যাণ", "কষ্ট", "কাঁচা", "কাঁটা", "কাঁধ", 
 "কাউন্টি", "কাউবয়", "কাকে", "কাগজ", "কাছাকাছি", "কাজ", "কাজিন", "কাটা", "কাঠ", "কাঠামো", "কাঠের", "কাদা", "কান",
 "কানাডিয়ান", "কান্না", "কাপ", "কাপড়", "কামড়", "কারখানা", "কারণ", "কারাগার", "কার্যক্রম", "কালো", "কাস্টম", "কিংবদন্তি", 
 "কিছু", "কিট", "কিনা", "কিন্তু", "কিভাবে", "কিশোর", "কুকি", "কুকুর", "কুচকাওয়াজ", "কুত্তা", "কুৎসিত", "কূটনৈতিক", "কূল",
 "কৃতজ্ঞ", "কৃত্রিম", "কৃষক", "কৃষি", "কেউ", "কেক", "কেন", "কেনা", "কেন্দ্র", "কেবল", "কেবিন", "কেরানি", "কোচ", "কোট",
 "কোড", "কোণ", "কোথায়", "কোনটি", "কোনোভাবে", "কোয়ার্টারব্যাক", "কোরিয়ান", "কোলেস্টেরল", "কোষ", "কোষাগার", "কৌতুক",
 "কৌতূহলী", "কৌশল", "ক্যামেরা", "ক্রনিকল", "ক্রমবর্ধমান", "ক্রয়", "ক্রল", "ক্রস", "ক্রিসমাস", "ক্রীড়াবিদ", "ক্রুজ", "ক্রেডিট", 
 "ক্র্যাশ", "ক্লাস", "ক্লিক", "ক্ষতি", "ক্ষমতা", "ক্ষুদ্র", "ক্ষেত্র", "খবর", "খরগোশ", "খরচ", "খসড়া", "খাঁচা", "খাঁড়ি", "খাওয়া", 
 "খাতির", "খাদ্য", "খাবার", "খামার", "খারাপ", "খালা", "খালি", "খুচরা", "খুব", "খুশি", "খেলনা", "খেলা", "খেলোয়াড়", "খোঁজা",
 "খোজা", "খোলা", "খ্যাতি", "খ্রিস্টান", "গঠন", "গঠিত", "গড়", "গণতন্ত্র", "গণতান্ত্রিক", "গণনা", "গণিত", "গতকাল", "গতি", 
 "গতিবিদ্যা", "গতিশীল", "গন্তব্য", "গন্ধ", "গবেষণা", "গভর্নর", "গভীর", "গরম", "গর্ত", "গর্বিত", "গর্ভপাত", "গলফ", "গলা", 
 "গলি", "গলে", "গল্প", "গসপেল", "গাঁজা", "গাইড", "গাছ", "গাড়ী", "গাদা", "গাধা", "গান", "গাভী", "গায়ক", "গার্হস্থ্য", "গাল",
 "গিটার", "গিয়ার", "গির্জা", "গুচ্ছ", "গুজব", "গুণমান", "গুপ্তচর", "গুরুত্বপূর্ণ", "গুলি", "গুল্ম", "গুহা", "গৃহ", "গৃহহীন", "গেট",
 "গোড়ালি", "গোপ", "গোপন", "গোয়েন্দা", "গোলমাল", "গোলাপী", "গৌণ", "গ্যাস", "গ্রহণ", "গ্রাম", "গ্রীষ্ম", "গ্রেফতার", "গ্র্যান্ড", 
 "গ্লাস", "গ্লোব", "ঘটনা", "ঘটবে", "ঘড়ি", "ঘণ্টা", "ঘনত্ব", "ঘনিষ্ঠভাবে", "ঘন্টা", "ঘষা", "ঘাটতি", "ঘাড়", "ঘাম", "ঘাস", "ঘিরে",
 "ঘুম", "ঘুমন্ত", "ঘুষি", "ঘৃণা", "ঘোড়া", "ঘোষণা", "চকমক", "চকোলেট", "চটুল", "চড়", "চতুর্থাংশ", "চমত্কার", "চমৎকার", "চরম",
 "চরিত্র", "চর্বি", "চলমান", "চলিত", "চল্লিশ", "চাঁদ", "চাই", "চাওয়া", "চাকরি", "চাকা", "চাক্ষুষ", "চাচা", "চাপ", "চাবি", "চামড়া", 
 "চার", "চার্জ", "চাল", "চালান", "চালু", "চাহিদা", "চিকিৎসা", "চিঠি", "চিত্র", "চিনতে", "চিনি", "চিন্তা", "চিপ", "চিরতরে", "চিহ্ন", 
 "চিৎকার", "চীনা", "চুক্তি", "চুম্বন", "চুরি", "চুল", "চুলা", "চুষা", "চূড়ান্ত", "চেইন", "চেক", "চেতনা", "চেম্বার", "চেয়ে", "চেহারা", 
 "চোখ", "চোদা", "চোয়াল", "চোর", "চ্যালেঞ্জ", "ছন্দ", "ছবি", "ছয়", "ছাঁকনি", "ছাইপাঁশ", "ছাড়া", "ছাত্র", "ছাদ", "ছাপ", "ছাপা",
 "ছায়া", "ছুটি", "ছুরি", "ছেড়ে", "ছেলে", "ছোট", "জটিল", "জড়িত", "জনগণনা", "জনপ্রিয়", "জনসংখ্যা", "জন্তু", "জন্ম", "জন্য", 
 "জমা", "জমি", "জয়", "জরিপ", "জরিমানা", "জরুরী", "জলপাই", "জলবায়ু", "জাগ্রত", "জাতি", "জাতীয়", "জাদু", "জানলা", 
 "জানানো", "জানি", "জানুয়ারী", "জাপানি", "জার", "জারজ", "জার্নাল", "জালিয়াতি", "জাহান্নাম", "জিজ্ঞাসা", "জিন", "জিনিস",
 "জিন্স", "জিম", "জিম্মি", "জিহ্বা", "জীব", "জীবন", "জীববিজ্ঞান", "জীবাশ্ম", "জীবিত", "জুড়ে", "জুতা", "জুন", "জুনিয়র", "জুরি",
 "জুলাই", "জেট", "জেনেটিক", "জেল", "জেলা", "জৈব", "জৈবিক", "জোট", "জোড়া", "জোয়ার", "জোর", "জোরে", "জ্ঞান", "জ্বর",
 "জ্বলন্ত", "জ্বালানী", "জ্যাকেট", "ঝড়", "ঝরনা", "ঝরা", "ঝাঁকি", "ঝুঁকি", "ঝুড়ি", "ঝোঁক", "টমেটো", "টয়লেট", "টহল", "টাই",
 "টাইট", "টাওয়ার", "টাক", "টাকা", "টাচডাউন", "টান", "টানুন", "টানেল", "টাস্ক", "টি-শার্ট", "টিউমার", "টিকা", "টিকিট", "টিপ",
 "টিয়ার", "টিস্যু", "টীম", "টুইটার", "টুকরা", "টুপি", "টুর্নামেন্ট", "টুল", "টেকসই", "টেনিস", "টেপ", "টেবিল", "টেলিভিশন", "টোকা", 
 "ট্যাক্স", "ট্রমা", "ট্রাক", "ট্রিপ", "ট্রেন", "ট্র্যাক", "ঠক্ঠক্", "ঠাকুরমা", "ঠান্ডা", "ঠিক", "ঠিকানা", "ঠোঁট", "ডজন", "ডলার", 
 "ডাইনিং", "ডাউনলোড", "ডাকাতি", "ডাক্তার", "ডাম্প", "ডায়াবেটিস", "ডিএনএ", "ডিগ্রী", "ডিজিটাল", "ডিফল্ট", "ডিম", "ডিলার", 
 "ডিসেম্বর", "ডিস্ক", "ডুব", "ডেক", "ডেস্ক", "ডোজ", "ডোমেইন", "ড্রপ", "ড্রাইভ", "ড্রেন", "ঢাল", "ঢালাই", "তত্ত্ব", "তথাকথিত",
 "তথ্য", "তদন্ত", "তদারকি", "তবুও", "তরঙ্গ", "তরল", "তরুণ", "তলোয়ার", "তহবিল", "তাঁবু", "তাই", "তাক", "তাকান", "তাকে", 
 "তাজা", "তাড়াতাড়ি", "তাত্ত্বিক", "তাদের", "তাপ", "তাপমাত্রা", "তামাক", "তার", "তারকা", "তারপর", "তারা", "তারিখ", "তারের", 
 "তালা", "তালিকা", "তাৎপর্য", "তিক্ত", "তিন", "তিনি", "তিমি", "তীক্ষ্ণ", "তীব্র", "তীর", "তুরস্ক", "তুলনামূলকভাবে", "তুলা", "তুষার",
 "তৃতীয়", "তেল", "তোমার", "তোয়ালে", "ত্রাণ", "ত্রিশ", "ত্রুটি", "থলে", "থাকা", "থাবা", "থামা", "থাম্ব", "থালা", "থিম", "থিয়েটার",
 "থুতনি", "থেকে", "থেরাপি", "থ্রেড", "দক্ষিণ", "দখল", "দড়ি", "দত্তক", "দপ্তর", "দম্পতি", "দরকারী", "দরজা", "দরিদ্র", "দর্শনার্থী",
 "দশক", "দস্তানা", "দাঁড়ানো", "দাঁত", "দাতা", "দাদা", "দাদী", "দান", "দানব", "দানশীলতা", "দাপ্তরিক", "দাবি", "দায়িত্ব", "দারিদ্র্য", 
 "দাস", "দাসত্ব", "দিকে", "দিগন্ত", "দিতে", "দিন", "দীর্ঘ", "দুঃখিত", "দুঃস্বপ্ন", "দুই", "দুইবার", "দুধ", "দুপুর", "দুর্ঘটনা", "দূতাবাস",
 "দূরত্ব", "দূরবর্তী", "দূরে", "দূষণ", "দৃঢ়", "দৃশ্য", "দৃষ্টি", "দেউলিয়া", "দেওয়া", "দেখা", "দেখুন", "দেরী", "দেশ", "দৈত্য", "দৈনিক", 
 "দৈর্ঘ্য", "দোকান", "দোল", "দোষ", "দোষী", "দ্বারা", "দ্বিতীয়", "দ্বীপ", "দ্য", "দ্রুত", "ধনী", "ধন্যবাদ", "ধরণ", "ধরনের", "ধরা", 
 "ধরুন", "ধর্মীয়", "ধর্ষণ", "ধাক্কা", "ধাতু", "ধারক", "ধারণা", "ধারাবাহিকভাবে", "ধার্মিকতা", "ধীর", "ধুলো", "ধূসর", "ধৃষ্টতা", "ধৈর্য", 
 "ধোঁয়া", "ধোয়া", "ধ্বংস", "ধ্রুবক", "নকল", "নকশা", "নগদ", "নগ্ন", "নজরদারি", "নতুন", "নথি", "নদী", "নবী", "নবীন",
 "নভেম্বর", "নমুনা", "নয়টি", "নরম", "নর্তকী", "নাক", "নাগরিক", "নাচ", "নাটকীয়", "নাবালকত্ব", "নাবিকদল", "নাম", "নায়ক", "নার্স",
 "নিঃসরণ", "নিক্ষেপ", "নিখুঁত", "নিখোঁজ", "নিগমবদ্ধ", "নিচে", "নিছক", "নিজস্ব", "নিজেকে", "নিতম্ব", "নিন্দা", "নিবন্ধ", "নিম্ন", 
 "নিয়ন্ত্রণ", "নিরপেক্ষ", "নিরাপত্তা", "নির্মাণ", "নিশ্চিত", "নিষেধাজ্ঞা", "নিষ্পত্তি", "নিহিত", "নীচে", "নীতি", "নীরবতা", "নীল", "নেকড়ে",
 "নেট", "নেতা", "নেতিবাচক", "নেতৃত্ব", "নৈতিক", "নৈপুণ্য", "নৈমিত্তিক", "নোংরা", "নোঙ্গর", "নোটিশ", "নৌকা", "নৌবাহিনী", "ন্যায্য", 
 "পকেট", "পক্ষপাত", "পছন্দ", "পঞ্চম", "পটভূমি", "পটান", "পড়া", "পণ্ডিত", "পণ্য", "পতন", "পতাকা", "পত্নী", "পত্রিকা", "পদক", 
 "পদক্ষেপ", "পদত্যাগ", "পদমর্যাদা", "পদার্থ", "পদোন্নতি", "পদ্ধতি", "পনির", "পনের", "পন্থা", "পবিত্র", "পরক", "পরবর্তী", "পরম", 
 "পরাজয়", "পরামর্শ", "পরাস্ত", "পরিকল্পনা", "পরিচালক", "পরিণতি", "পরিত্রাণ", "পরিদর্শন", "পরিধান", "পরিবার", "পরিমাণ", "পরিষ্কার",
 "পরিসীমা", "পরীক্ষা", "পরে", "পর্দা", "পর্বত", "পর্যন্ত", "পলায়ন", "পশু", "পশ্চিম", "পাঁচ", "পাই", "পাইন", "পাইপ", "পাউডার", 
 "পাউন্ড", "পাওয়া", "পাখা", "পাখি", "পাগড়ি", "পাগল", "পাচক", "পাঠ", "পাঠক", "পাঠান", "পাঠ্য", "পাতলা", "পাতা", "পাত্র", 
 "পাথর", "পাপ", "পাবলিক", "পাম", "পাম্প", "পায়খানা", "পারমাণবিক", "পারস্পরিক", "পারে", "পার্টি", "পালঙ্ক", "পালা", "পাল্টা",
 "পাশ", "পাশাপাশি", "পাশে", "পাস", "পাসিং", "পাহাড়", "পিকআপ", "পিচ", "পিছনে", "পিজা", "পিট", "পিতা", "পিপা", "পিয়ানো",
 "পিষা", "পিসি", "পুঁজিবাদ", "পুকুর", "পুঙ্খানুপুঙ্খভাবে", "পুণ্য", "পুতুল", "পুত্র", "পুনঃমূল্যায়ন", "পুনরাবৃত্তি", "পুরস্কার", "পুরাতন", 
 "পুরুষ", "পুরোপুরি", "পুল", "পুলিশ", "পুষ্টি", "পূরণ", "পূর্ব", "পৃথক্", "পৃথিবী", "পৃষ্ঠা", "পেঁয়াজ", "পেইন্টিং", "পেছনে", "পেট", 
 "পেটেন্ট", "পেনশন", "পেমেন্ট", "পেরেক", "পেশাদার", "পেশী", "পোকা", "পোড়া", "পোতাশ্রয়", "পোর্টফোলিও", "পোল", "পোশাক",
 "পোষাক", "পোস্ট", "পৌঁছানো", "প্যাটার্ন", "প্রক্রিয়া", "প্রগতিশীল", "প্রচেষ্টা", "প্রজাতন্ত্র", "প্রণোদনা", "প্রতি", "প্রথম", "প্রদর্শন", 
 "প্রধান", "প্রবিধান", "প্রভাব", "প্রমান", "প্রয়োজন", "প্রশ্ন", "প্রস্তুত", "প্রহরী", "প্রায়ই", "প্রিয়", "প্রেস", "প্রোটিন", "প্লাস", "প্লেট", 
 "প্ল্যাটফর্ম", "ফটোগ্রাফার", "ফরাসি", "ফর্ম", "ফলন", "ফলাফল", "ফসল", "ফাঁক", "ফাঁদ", "ফাংশন", "ফাইবার", "ফাইল", "ফাটল", 
 "ফালা", "ফিট", "ফিটনেস", "ফিল্ম", "ফিসফিস", "ফুটপাথ", "ফুটবল", "ফুল", "ফুসফুস", "ফেডারেল", "ফেব্রুয়ারী", "ফেরেশতা", 
 "ফোকাস", "ফোন", "ফোরাম", "ফ্যাক্টর", "ফ্রিকোয়েন্সি", "ফ্রেম", "ফ্লাইট", "ফ্ল্যাশ", "বক্তৃতা", "বক্ররেখা", "বছর", "বড়", "বড়ি", 
 "বনাম", "বন্দুক", "বন্ধ", "বন্য", "বয়স", "বরং", "বরফ", "বরাবর", "বর্গক্ষেত্র", "বর্জ্য", "বর্ণনা", "বর্তমান", "বলা", "বলিদান", 
 "বলুন", "বসন্ত", "বসা", "বস্তু", "বহন", "বহিরাগত", "বাঁক", "বাইক", "বাইবেল", "বাইরে", "বাউন্স", "বাকি", "বাক্স", "বাগ", "বাগান",
 "বাঘ", "বাচ্চা", "বাছাই", "বাজার", "বাজি", "বাজেট", "বাট", "বাটি", "বাড়ি", "বাণিজ্য", "বাতিল", "বাদ", "বাদামী", "বাদ্যযন্ত্র", "বাধা",
 "বাধ্যবাধকতা", "বানর", "বানান", "বান্ধবী", "বাবা", "বাম", "বায়ু", "বার", "বারান্দা", "বারো", "বার্তা", "বালি", "বাষ্প", "বাস", "বাসস্থান",
 "বাসিন্দা", "বাস্তব", "বাহক", "বাহু", "বিঃদ্রঃ", "বিকল্প", "বিকাশ", "বিকিরণ", "বিকেল", "বিক্রি", "বিখ্যাত", "বিচরণ", "বিচার", "বিচ্ছেদ",
 "বিছানা", "বিছিন্ন", "বিজয়", "বিজ্ঞান", "বিট", "বিড", "বিড়াল", "বিতর্ক", "বিদায়", "বিদেশী", "বিদ্যালয়", "বিধান", "বিনয়ী", "বিনামূল্যে", 
 "বিনিয়োগ", "বিনোদন", "বিন্দু", "বিপজ্জনক", "বিপদ", "বিপরীত", "বিপ্লব", "বিবর্তন", "বিবাহ", "বিবৃতি", "বিবেচনা", "বিভক্ত", "বিভাগ",
 "বিভিন্ন", "বিভ্রান্তি", "বিমানবন্দর", "বিমূর্ত", "বিয়ার", "বিরক্তিকর", "বিরতি", "বিরল", "বিরুদ্ধে", "বিরোধিতা", "বিল", "বিলম্ব", "বিলিয়ন", 
 "বিশ", "বিশদ", "বিশপ", "বিশাল", "বিশিষ্ট", "বিশুদ্ধ", "বিশৃঙ্খলা", "বিশেষ", "বিশ্ব", "বিষণ্ণতা", "বিষয়", "বিষাক্ত", "বিষ্ঠা", "বিস্তারিত", 
 "বীজ", "বীট", "বীমা", "বুক", "বুট", "বুদ্ধিমত্তা", "বুধবার", "বুম", "বুলেট", "বৃত্ত", "বৃদ্ধি", "বৃষ্টি", "বৃহস্পতিবার", "বেক", "বেকারত্ব", 
 "বেগুনি", "বেড়া", "বেতন", "বেদনাদায়ক", "বেনামী", "বেল্ট", "বেশ", "বেসবল", "বেসমেন্ট", "বেসামরিক", "বোন", "বৈচিত্র্য", 
 "বৈজ্ঞানিক", "বৈদ্যুতিক", "বৈধ", "বৈশিষ্ট্য", "বৈষম্য", "বোকা", "বোঝা", "বোতল", "বোতাম", "বোনাস", "বোবা", "বোমা", "বোর্ড", 
 "ব্যক্তি", "ব্যতিক্রম", "ব্যথা", "ব্যবহার", "ব্যয়বহুল", "ব্যর্থ", "ব্যস্ত", "ব্যাপার", "ব্যুরো", "ব্রাশ", "ব্রিটিশ", "ব্র্যান্ড", "ব্লক", "ব্লগ", "ব্লেড",
 "ভজনা", "ভদ্রমহিলা", "ভবন", "ভবিষ্যৎ", "ভয়", "ভয়ঙ্কর", "ভয়ানক", "ভয়েস", "ভর্তি", "ভাঁজ", "ভাই", "ভাইবোন", "ভাইরাস", "ভাইস",
 "ভাগ", "ভাগা", "ভাগ্যবান", "ভাঙ্গা", "ভাড়া", "ভাবপ্রবণতা", "ভার", "ভারতীয়", "ভারসাম্য", "ভারী", "ভাল", "ভালবাসা", "ভালুক", "ভাষা",
 "ভাষ্য", "ভাসা", "ভাস্কর্য", "ভিজা", "ভিটামিন", "ভিড়", "ভিডিও", "ভিতরে", "ভিত্তি", "ভিন্ন", "ভীত", "ভীতিকর", "ভুট্টা", "ভুল", "ভূমিকা",
 "ভেড়া", "ভোক্তা", "ভোগা", "ভোট", "ভোটার", "ভোর", "ভ্যান", "ভ্রমণ", "মঙ্গলবার", "মজা", "মজাদার", "মঞ্চ", "মডেল", "মণ্ডল", 
 "মতবাদ", "মতভেদ", "মতাদর্শ", "মতামত", "মদ্যপান", "মধু", "মধ্যে", "মনিটর", "মনে", "মনোনিবেশ", "মনোবিজ্ঞান", "মনোভাব", 
 "মনোযোগ", "মন্তব্য", "মন্দ", "ময়দা", "ময়লা", "মরিচ", "মরিয়া", "মরীচি", "মরুভূমি", "মর্মাহত", "মর্যাদা", "মসৃণ", "মস্তিষ্ক", "মহাদেশ",
 "মহান", "মহাসাগর", "মহিমা", "মহিলা", "মাংস", "মাইল", "মাউন্ট", "মাউস", "মাখন", "মাছ", "মাছি", "মাটি", "মাতাল", "মাত্রা", "মাথা", 
 "মাধ্যম", "মান", "মানচিত্র", "মানব", "মানসিক", "মানুষ", "মানে", "মাপা", "মামলা", "মামা", "মারা", "মার্কিন", "মালিক", "মাস", 
 "মাসিক", "মাস্টার", "মিছরি", "মিটার", "মিটিং", "মিডিয়া", "মিত্র", "মিথষ্ক্রিয়া", "মিথ্যা", "মিনিট", "মিম", "মিমি-হুম", "মিলন", "মিলিয়ন",
 "মিশন", "মিশ্রণ", "মিষ্টি", "মিসাইল", "মুকুট", "মুক্তি", "মুখ", "মুখপাত্র", "মুখোমুখি", "মুছা", "মুঠোফোন", "মুদিখানা", "মুদ্রাস্ফীতি", "মুরগি",
 "মুষ্টি", "মুসলিম", "মুহূর্ত", "মূর্খ", "মূল", "মূলত", "মূলধন", "মূল্য", "মৃত", "মৃত্যু", "মৃদু", "মেইল", "মেকআপ", "মেকানিক", "মেক্সিকান",
 "মেঘ", "মেজাজ", "মেঝে", "মেয়ে", "মেরামত", "মেরু", "মেশিন", "মেস", "মোচড়", "মোজা", "মোট", "মোটর", "মোটামুটি", "মোড", 
 "মোড়ানো", "মোমবাতি", "মৌখিক", "মৌমাছি", "মৌলবাদী", "মৌলিক", "মৌসম", "ম্যানেজার", "যখন", "যখনই", "যত্ন", "যথাক্রমে", "যথাযথ",
 "যথেষ্ট", "যদি", "যদিও", "যন্ত্র", "যমজ", "যাইহোক", "যাওয়া", "যাজক", "যাত্রা", "যাদুঘর", "যানবাহন", "যান্ত্রিক", "যার", "যাহোক", "যুক্তি", 
 "যুগ", "যুদ্ধ", "যেকোনো", "যেখানে", "যেমন", "যোগ", "যোগদান", "যোগফল", "যোগাযোগ", "যোগ্যতা", "যোদ্ধা", "যৌক্তিক", "যৌগ", "যৌথ",
 "যৌন", "যৌনতা", "যৌনভাবে", "যৌবন", "রকেট", "রক্ত", "রক্ষা", "রপ্তানি", "রবিবার", "রসুন", "রহস্য", "রাইফেল", "রাক্ষস", "রাখা", "রাগ",
 "রাগান্বিত", "রাজকীয়", "রাজত্ব", "রাজনৈতিক", "রাজপুত্র", "রাজস্ব", "রাজা", "রাজ্য", "রাণী", "রাত", "রানার", "রান্নাঘর", "রায়", "রাশিয়ান",
 "রাষ্ট্রপতি", "রাসায়নিক", "রাস্তা", "রিং", "রিজ", "রিপোর্ট", "রিসিভার", "রুকি", "রুক্ষ", "রুট", "রুটি", "রুপক", "রুম", "রূপান্তর", "রেঁস্তোরা",
 "রেকর্ড", "রেজোলিউশন", "রেটিং", "রেডিও", "রেন্ডার", "রেফারেন্স", "রেল", "রেলপথ", "রেসিপি", "রোগ", "রোগা", "রোগী", "রোবট", "রোমান্টিক",
 "রোম্যান্স", "রোল", "লক্ষ্য", "লঙ্ঘন", "লজ্জা", "লতা", "লবণ", "লবি", "লম্বা", "লাইন", "লাইব্রেরি", "লাইসেন্স", "লাঠি", "লাথি", "লাফ", 
 "লাভ", "লাল", "লিখিত", "লিখুন", "লিঙ্ক", "লিপি", "লিফট", "লীগ", "লুকান", "লুপ", "লেখক", "লেখা", "লেজ", "লেজার", "লেনদেন", 
 "লেন্স", "লেবু", "লেবেল", "লোক", "লোহা", "ল্যাব", "শক্তিশালী", "শতক", "শতাংশ", "শতাব্দী", "শত্রু", "শনিবার", "শপথ", "শব্দ", "শয়তান",
 "শয়নকক্ষ", "শরীর", "শর্তাবলী", "শস্য", "শহর", "শহরতলির", "শহরবাসী", "শহুরে", "শাকসবজি", "শাখা", "শাটল", "শান্তি", "শারীরিক", "শার্ট",
 "শালীন", "শাসন", "শাস্তি", "শিং", "শিকার", "শিক্ষক", "শিখতে", "শিখর", "শিখা", "শিবির", "শিম", "শিরস্ত্রাণ", "শিরোনাম", "শিলা", "শিল্প",
 "শিশু", "শীঘ্রই", "শীট", "শীতকাল", "শীতল", "শীর্ষ", "শুকনো", "শুক্রবার", "শুটিং", "শুধু", "শুনতে", "শুনানি", "শুনুন", "শুরু", "শূকর", 
 "শূন্য", "শৃঙ্খলা", "শেখান", "শেরিফ", "শেল", "শেষ", "শৈলী", "শৈল্পিক", "শৈশব", "শোষণ", "শ্বাস", "শ্রম", "শ্রুতি", "শ্রেণী", "শ্রোতা", "শ্লীলতা",
 "শ্লোক", "ষড়যন্ত্র", "ষষ্ঠ", "ষাঁড়", "সংকট", "সংকল্প", "সংকীর্ণ", "সংকেত", "সংক্ষিপ্ত", "সংখ্যা", "সংগঠন", "সংগ্রহ", "সংঘ", "সংঘর্ষ", "সংচিতি",
 "সংজ্ঞা", "সংবাদপত্র", "সংবিধান", "সংবেদনশীল", "সংমিশ্রণ", "সংযোগ", "সংরক্ষণ", "সংলাপ", "সংশোধন", "সংসদ", "সংস্কৃতি", "সকাল", "সক্রিয়",
 "সক্ষম", "সঙ্গে", "সচিব", "সচেতন", "সজ্জীকরণ", "সঞ্চালন", "সঠিক", "সতর্ক", "সতীর্থ", "সত্ত্বেও", "সত্যিই", "সদস্য", "সদৃশ", "সনদ",
 "সনদপত্র", "সনাক্তকরণ", "সন্তুষ্ট", "সন্দেহ", "সন্ধ্যা", "সন্নিবেশ", "সপ্তাহ", "সফটওয়্যার", "সফর", "সফল", "সফলভাবে", "সবকিছু", "সবাই", 
 "সবুজ", "সবে", "সভ্যতা", "সমকামী", "সমতল", "সমতা", "সমন্বয়", "সময়", "সমর্থন", "সমষ্টিগত", "সমসাময়িক", "সমস্যা", "সমাজ", "সমাধান",
 "সমান", "সমাবেশ", "সমালোচনামূলক", "সমীকরণ", "সমুদ্র", "সম্পর্কিত", "সম্ভবত", "সম্মেলন", "সরকার", "সরঞ্জাম", "সরবরাহ", "সরানো", 
 "সরাসরি", "সর্বাধিক", "সশস্ত্র", "সস্তা", "সহকর্মী", "সহকারী", "সহচর", "সহজ", "সহজে", "সহযোগী", "সহায়ক", "সহিংসতা", "সাংবাদিক", 
 "সাংস্কৃতিক", "সাইকেল", "সাইট", "সাইডবার", "সাক্ষাৎকার", "সাজসরঁজাম", "সাজান", "সাত", "সাথী", "সাদা", "সাধনা", "সাধারণ", "সাধু", "সাপ",
 "সাপ্তাহিক", "সাফল্য", "সাবধানে", "সাবেক", "সামগ্রিক", "সামঞ্জস্যপূর্ণ", "সামনে", "সামরিক", "সামলাতে", "সামান্য", "সামিট", "সামুদ্রিক", 
 "সাম্প্রতিক", "সারসংক্ষেপ", "সারাংশ", "সারি", "সার্কিট", "সালাদ", "সাশ্রয়ী", "সাহস", "সাহায্য", "সাহিত্য", "সিঁড়ি", "সিংহ", "সিইও", "সিগারেট",
 "সিডি", "সিদ্ধান্ত", "সিনেমা", "সিন্ড্রোম", "সিরিজ", "সিলিং", "সীমা", "সীমিত", "সীল", "সুই", "সুইচ", "সুইট", "সুখ", "সুখী", "সুদর্শন", "সুনির্দিষ্ট",
 "সুন্দর", "সুপারিশ", "সুবিধা", "সুযোগ", "সুর", "সুরক্ষা", "সুস্থ", "সূক্ষ্ম", "সূচক", "সূত্র", "সূর্য", "সৃজনশীল", "সৃষ্টি", "সেক্টর", "সেখানে", 
 "সেগমেন্ট", "সেগুলো", "সেট", "সেতু", "সেনাবাহিনী", "সেন্সর", "সেপ্টেম্বর", "সেবা", "সেরা", "সেলিব্রিটি", "সেশন", "সৈকত", "সৈনিক", "সৈন্য",
 "সোজা", "সোনা", "সোভিয়েত", "সোমবার", "সৌন্দর্য", "সৌর", "স্কাউট", "স্কি", "স্কেল", "স্কোর", "স্ক্রু", "স্টক", "স্টার্টার", "স্টুডিও", "স্টেশন",
 "স্টোরেজ", "স্ট্রিং", "স্তন", "স্তব্ধ", "স্তর", "স্ত্রী", "স্থপতি", "স্থল", "স্থান", "স্থিতিশীল", "স্থূল", "স্নাতক", "স্ন্যাপ", "স্পট", "স্পন্দন", "স্পর্শ", 
 "স্পষ্টতই", "স্পিকার", "স্পেনীয়", "স্ফটিক", "স্ব", "স্বতন্ত্র", "স্বদেশ", "স্বপ্ন", "স্বয়ংক্রিয়", "স্বর্গ", "স্বাস্থ্য", "স্বীকার", "স্বেচ্ছাসেবক", "স্মার্ট", "স্মৃতি",
 "স্যার", "স্যুট", "স্লাইড", "স্লিপ", "হকি", "হচ্ছে", "হঠাৎ", "হতাশ", "হত্তয়া", "হত্যা", "হবে", "হয়", "হয়রানি", "হয়ে", "হরিণ", "হলওয়ে", 
 "হলুদ", "হস্তক্ষেপ", "হাঁটা", "হাঁস", "হাইওয়ে", "হাউজিং", "হাঙ্গর", "হাজার", "হাড়", "হাত", "হাতল", "হাতি", "হামলা", "হার", "হারান", 
 "হারিকেন", "হার্ডওয়্যার", "হালকাভাবে", "হালনাগাদ", "হাসপাতাল", "হাসি", "হাস্যকর", "হিংস্র", "হিমায়িত", "হিসাবে", "হিস্পানিক", "হীরা", "হুক",
 "হুম", "হুমকি", "হুহ", "হৃদয়", "হেফাজত", "হেলিকপ্টার", "হোটেল", "হোস্ট", "হ্যাঁ", "হ্রদ", "হ্রাস" ];

const checkIfPrefixesNotReused = () => {
	let prefix = '';
	let used_prefixes = [];
	let word_checked_count = 0;
	
	for (let i=0; i<BENGALI_MNEMONICS.length; i++) {
		let word = BENGALI_MNEMONICS[i];
		if (word.length == 3) prefix = word;
        else                  prefix = word.substring(0,4);

		if (used_prefixes.indexOf(word) == -1) {
			used_prefixes.push(prefix);
		}
		else throw new Error("Reused prefix: " + prefix); 
		
		word_checked_count++;		
	}
	console.log("> word_checked_count: " + word_checked_count);
} // checkIfPrefixesNotReused()
// checkIfPrefixesNotReused();

const toText = () => {
	for (let i=0; i<BENGALI_MNEMONICS.length; i++) {
			console.log(BENGALI_MNEMONICS[i]);
	}
} // toText
// toText();

if (typeof exports === 'object') {
	exports.BENGALI_MNEMONICS = BENGALI_MNEMONICS	
} // exports of 'BN_2048_mnemonics.js'
